Repository: BloomBooks/BloomDesktop
Catalog: DistFiles/localization/Palaso.sw.tmx
Source language: sw
Languages: en

source: Imejengwa kwa {0}
en: Built on {0}

source: Hakuna utengenezaji upya
en: No Updates

source: Kuhusu {0}
en: About {0}

source: Tafuta utengenezaji upya
en: Check For Updates

source: Muhtasari wa toleo
en: Release Notes

source: Nakala nyingine ya programu tayari inaendelea. Iwapo huwezi kuipata, fungua upya kompyuta yako.
en: Another copy of the application is already running. If you cannot find it, restart your computer.

source: Nakala nyingine ya {0} tayari inaendelea. Iwapo huwezi kupata nakala hiyo ya {0}, fungua upya kompyuta yako.
en: Another copy of {0} is already running. If you cannot find that copy of {0}, restart your computer.

source: Kulikuwa na tatizo katika kuanzisha programu ambayo inaweza kukuhitaji kufungua upya kompyuta yako.
en: There was a problem starting the application which might require that you restart your computer.

source: Kulikuwa na tatizo katika kuanzisha {0} ambayo inaweza kukuhitaji kufungua upya kompyuta yako.
en: There was a problem starting {0} which might require that you restart your computer.

source: Kungoja programu nyingine kumaliza...
en: Waiting for other application to finish...

source: Kungoja {0} nyingine kumaliza...
en: Waiting for other {0} to finish...

source: U&batilishe
en: &Cancel

source: La
en: No

source: &Sawa
en: &OK

source: Ndiyo
en: Yes

source: {0} itapelekwa kwenye pipa la takataka.
en: {0} will be moved to the Recycle Bin.

source: Thibitisha Kufutwa
en: Confirm Delete

source: U&fute
en: &Delete

source: Zipo picha {0} zilizo na majina yanayokaribiana na
en: Found {0} images with names close to {1}

source: Sanaa ya Kusoma
en: Art Of Reading

source: Kamera
en: Camera

source: Tumia {0}
en: Use {0}

source: Kata
en: Crop

source: Pakua Kifaa cha Kuweka Sanaa ya Kusoma
en: Download Art Of Reading Installer

source: Hakiki...
en: Edit...

source: Hii ni sanaa ya 'Sanaa ya Kusoma'. Katika kisanduku kilicho hapo juu, andika unachotafuta, kisha ubonyeze INGIA. Unaweza kupiga chapa maneno kwa Kiingereza na kiindonesia.
en: This is the 'Art Of Reading' gallery. In the box above, type what you are searching for, then press ENTER. You can type words in English and Indonesian.

source: Faili
en: File

source: Samahani, kulikuwa na hitilafu katika kupata picha.
en: Sorry, something went wrong while getting the image.

source: Samahani kulikuwa na hitilafu kwenye Kisanduku cha vifaa cha picha
en: Sorry, something went wrong with the ImageToolbox

source: Pata picha
en: Get Picture

source: Kisanduku cha vifaa cha picha
en: Image Toolbox

source: Weka kifurushi cha Sanaa ya Kusoma (hii inaweza kutendeka polepole sana)
en: Install the Art Of Reading package (this may be very slow)

source: Picha {0} zilipatikana
en: Found {0} images

source: Je, unajua kuwa kuna toleo jipya la mkusanyiko huu inayokuruhusu kutafuta kwa Kiarabu, Kibengali, Kichina, Kiingereza, Kifaransa, Kiindonesia, Kihindi, Kireno, Kihispania, Kithai au Kiswahili? Ni bure na inapatika kupakua.
en: Did you know that there is a new version of this collection which lets you search in Arabic, Bengali, Chinese, English, French, Indonesian, Hindi, Portuguese, Spanish, Thai, or Swahili? It is free and available for downloading.

source: Kompyuta hii inaonekana bado haijawekwa sanaa ya 'Sanaa ya Kusoma'.
en: This computer doesn't appear to have the 'Art Of Reading' gallery installed yet.

source: Hakuna picha zinazoambatana zilizopatikana
en: Found no matching images

source: faili za picha
en: picture files

source: Tatizo katika kupata picha
en: Problem Getting Image

source: Samahani, kulikuwa na tatizo katika kupata picha hiyo.
en: Sorry, there was a problem loading that image.

# Picha hii haijui: Ni nani aliyeitengeneza? Ni nani anayeweza kuitumia?
source: Picha hii haijui:\n\nNi nani aliyeitengeneza?\nNi nani anayeweza kuitumia?
en: This image does not know:\n\nWho created it?\nWho can use it?

source: Skana
en: Scanner

source: Tafuta katika Sanaa ya Sanaa ya Kusoma
en: Search the Art of Reading Gallery

source: Kwa sasa kisanduku cha kutafuta kiko {0}
en: The search box is currently set to {0}

source: Tayarisha Metadata...
en: Set up metadata...

source: Majina Mengine
en: Other Names

source: Orodha hii inapaswa kujumuisha lugha zote za ISO-639 ikijumuisha majina yote mbadala yanayojulikana kwa ethnologue.com.\n\nIkiwa itahitajika, tumia chaguo la "Lugha isiyoorodheshwa", ambalo litachaguliwa sasa.
en: This list should include all the ISO-639 languages, including all the alternative names known to ethnologue.com.\n\nIf necessary, use the "Unlisted Language" option, which will be selected for you now.

source: Kuhusu Majina Mafupi ya Lugha 639-3 na Jinsi ya Kupata Mengine Mapya
en: About Language 639-3 Codes & How To Apply For New Ones

source: Kuhusu usajili wa Lugha wa ISO
en: About The ISO Language Registry

source: Jina la fupi
en: Code

source: {0} Nchi
en: {0} Countries

source: Nchi
en: Country

source: Unaweza kubadilisha jinsi jina la lugha litaonekana hapa:
en: You can change how the language name will be displayed here:

source: Tazama Jina Fupi la Lugha...
en: Lookup Language Code...

source: Jina
en: Name

source: Onyesha lahaja za kieneo
en: Show regional dialects

source: Lugha Isiyoorodheshwa
en: Unlisted Language

source: Hauwezi Kupata lugha yako?
en: Can't find your language?

source: Kwa bahati mbaya, kumbukumbu la {0} linaanza kuelekea kuisha, na hivi karibuni inaweza kusonga polepole au kupata matatizo mengine. Tunapendekeza kuwa uache au uifungue upya inapofaa.
en: Unfortunately, {0} is starting to get short of memory, and may soon slow down or experience other problems. We recommend that you quit and restart it when convenient.

source: Aliyetengeneza: {0}
en: Creator: {0}

source: Aliyetengeneza
en: Creator

source: Habari kuhusu Leseni
en: License Info

source: Ni lazima uweke hati umiliki na sifa kwa waandishi, wachoraji, na kadhalika.
en: You must keep the copyright and credits for authors, illustrators, etc.

source: Uko huru kutumia toleo hili kwa njia ya kibiashara.
en: You are free to make commercial use of this work.

source: Unaruhusiwa kuibadilisha na kuongeza kwa toleo hili.
en: You may adapt and add to this work.

source: Unaweza kuibadilisha na kuongeza kwa toleo hili, lakini lazima usambaze matokeo ya kazi hii tu chini ya leseni hiyo hiyo au leseni inayofanana na hii.
en: You may adapt and add to this work, but you may distribute the resulting work only under the same or similar license to this one.

source: Huruhusiwi kufanya mabadiliko au kuongeza chochote zaidi kwa toleo hili bila idhini.
en: You may not make changes or build upon this work without permission.

source: Huruhusiwi kutumia toleo hili kwa shughuli za kibiashara.
en: You may not use this work for commercial purposes.

source: Iwapo utataka kuitumia tena, tafadhali wasiliana na aliye na haki ya kumiliki.
en: For permission to reuse, contact the copyright holder.

source: Hakuna leseni maalum
en: No license specified

source: Kubali kazi yako kutumika kwa shughuli za kibiashara?
en: Allow commercial uses of your work?

source: Kubali kazi yako ibadilishwe?
en: Allow modifications of your work?

source: Anayemiliki haki ya Kunakili
en: Copyright Holder

source: Tafsiri ya kati ya kiserikali
en: Intergovernmental Version

source: Kawaida
en: Custom

source: Haki ya kunakili na Leseni
en: Copyright and License

source: Sifa, Haki ya kunakili, na Leseni
en: Credit, Copyright, and License

source: Wasiliana na aliye na haki ya kunakili ili kupata idhini
en: Contact the copyright holder for any permissions

source: Ndiyo, kama wengine wataishirikisha vile vile
en: Yes, as long as others share alike

source: Maombi zaidi
en: Additional Requests

source: habari zaidi
en: more info

source: Haiwezi Kutekelezwa
en: Not Enforceable

source: Hii pia inaweza kuficha vitufe vingine ambavyo havihitajiki na mtumiaji asiye na ufasaha wa juu.
en: This may also hide other buttons which are not needed by the non-advanced user.

source: Kitufe kitajitokeza utakapofinya kii za Ctrl na Shift kwa pamoja.
en: The button will show up when you hold down the Ctrl and Shift keys together.

source: Mipangilio...
en: Settings...

source: Ficha kitufe kinachofungua mipangilio.
en: Hide the button that opens settings.

source: Neno la siri la awali
en: Factory Password

source: Ili kuzuia mabadiliko yasiyokusudiwa, ambayo yanaweza kubadilisha kifaa hiki na kukifanya kutokutendea kazi, mipangilio hii imefungwa.
en: To prevent accidental changes which could cause this tool to stop working for you, these settings have been locked.

source: Neno la Siri la kulinda Mipangilio
en: Settings Protection Password

source: Onyesha Herufi
en: Show Characters

source: Neno la siri la awali la mipangilio hii ni "{0}". Iwapo utalisahau, unaweza kulitafuta kwenye google kwa "{1}" na "neno la siri la awali"
en: Factory password for these settings is "{0}". If you forget it, you can always google for "{1}" and "factory password"

source: Hitaji neno la siri la awali ili kuingia kwenye mipangilio.
en: Require the factory password to get into settings.

source: Ulinzi wa mipangilio
en: Settings Protection

source: &Fonti:
en: &Font:

source: (Fonti iliyochaguliwa haipatikani kwenye mtambo huu. Tunatumia kawaida)
en: (The selected font is not available on this machine. Using default.)

source: Huu ni mfumo wa kuandika wa kutoka kulia kwenda kushoto.
en: This is a &right to left writing system.

source: U&kubwa:
en: &Size:

source: &Eneo la kujaribisha:
en: &Test Area:

source: Iwapo kibodi unayohitaji haijaorodheshwa, bofya kiunganishi kinachofaa hapa chini ili kuiweka.
en: If the keyboard you need is not listed, click the appropriate link below to set it up

source: Mipangilio ya Windosi ya kibodi
en: Windows keyboard settings

source: Kibodi zinazopatikana
en: Available keyboards

source: Kibodi zilizotumika hapo awali
en: Previously used keyboards

source: Mipangilio ya Keyman
en: Keyman Configuration

source: Keyman 5.0 au ya karibu zaidi haijawekwa.
en: Keyman 5.0 or later is not Installed.

source: Chagua kibodi ambayo utatumia kuandika maandishi {0}
en: Select the &keyboard with which to type {0} text

source: &Eneo la kujaribisha (Tumia eneo hili ili kupiga chapa kitu cha kujaribisha kibodi yako)
en: &Test Area (Use this area to type something to test out your keyboard.)

source: Onyo
en: Warning

source: Imeshindwa kuunganishwa na SLDR
en: Unable to connect to SLDR

source: Programu imeshindwa kuunganishwa na Akiba ya Data ya SIL ili kupata habari ya hivi karibuni kuhusu lugha hii. Iwapo utatengeneza mfumo huu wa kuandika, mipangilio ya awali inaweza kutokuwa sahihi au kupitwa na wakati. Una uhakika kuwa unataka kutengeneza mfumo mpya wa kuandika?
en: The application is unable to connect to the SIL Locale Data Repository to retrieve the latest information about this language. If you create this writing system, the default settings might be incorrect or out of date. Are you sure you want to create a new writing system?
